//1. Написать скрипт, который сосчитает и выведет результат от возведения 2 в степень 10, начиная со степени 1.

/*for (i = 1; i <= 10; i++) {
    console.log(2 ** i)
};*/


//1*. Преобразовать 1 задачу в функцию, принимающую на вход степень, в которую будет возводиться число 2.

/*const exponentiate = (deg) => {
    for (i = 1; i <= deg; i++) {
    console.log(2 ** i)
}
}

exponentiate(5)*/



//2. Написать скрипт, который выведет 5 строк в консоль таким образом, чтобы в первой строчке выводилось :), во второй :):) и так далее.

for (i = 1; i <= 5; i++) {
   console.log() 
}